tap "agrinman/tap"
tap "amberframework/micrate"
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "shopify/shopify"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Modern, simple TCP tunnel in Rust that exposes local ports to a remote server
brew "bore-cli"
# Library for manipulating PNG images
brew "libpng"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generic machine emulator and virtualizer
brew "qemu"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Next-gen compiler infrastructure
brew "llvm"
# Manage compile and link flags for libraries
brew "pkg-config"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# OpenType text shaping engine
brew "harfbuzz"
# Image manipulation library
brew "jpeg"
# Lightweight application-protocol for resource-constrained devices
brew "libcoap"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Web and API based SMTP testing
brew "mailpit"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# State of the art linter for the Go programming language
brew "staticcheck"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# Database migration tool written in Crystal
brew "amberframework/micrate/micrate"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open-source browser prompter
cask "browserosaurus"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-0xproto"
cask "font-hack-nerd-font"
# Open source API development ecosystem
cask "hoppscotch"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Cross-platform MQTT 5.0 Desktop Client
cask "mqttx"
# Free and open-source RSS reader
cask "netnewswire"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Unicode keyboard layout editor
cask "ukelele"
# Investment portfolio tracker
cask "wealthfolio"
