tap "agrinman/tap"
tap "amberframework/micrate"
tap "cloudflare/cloudflare"
tap "koekeishiya/formulae"
tap "morantron/tmux-fingers"
tap "oven-sh/bun"
tap "supabase/tap"
# Run your GitHub Actions locally
brew "act"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Cross-platform HTTP benchmarking tool
brew "bombardier"
# Modern, simple TCP tunnel in Rust that exposes local ports to a remote server
brew "bore-cli"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Library for manipulating PNG images
brew "libpng"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Next-gen compiler infrastructure
brew "llvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Power of curl, ease of use of httpie
brew "curlie"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Library and utilities for processing GIFs
brew "giflib"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Fast linters runner for Go
brew "golangci-lint"
# OpenType text shaping engine
brew "harfbuzz"
# Image manipulation library
brew "jpeg"
# Library for interacting with JSON
brew "jsoncpp"
# Lightweight application-protocol for resource-constrained devices
brew "libcoap"
# Postgres C API library
brew "libpq"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Web and API based SMTP testing
brew "mailpit"
# Remote terminal application
brew "mosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@11"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# State of the art linter for the Go programming language
brew "staticcheck"
# SMTP command-line test tool
brew "swaks"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Database migration tool written in Crystal
brew "amberframework/micrate/micrate"
# mouseless terminal interaction
brew "morantron/tmux-fingers/tmux-fingers"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Supabase CLI
brew "supabase/tap/supabase"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# Email client
cask "fastmail"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop automation application
cask "hammerspoon"
# Chromium-based web browser
cask "helium-browser"
# Vector graphics editor
cask "inkscape"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Team communication and collaboration software
cask "slack"
# CSV file editor
cask "table-tool"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
go "github.com/air-verse/air"
go "github.com/bootdotdev/bootdev"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/todaatsushi/twt"
cargo "nvim-mcp"
cargo "sleek"
